//=========================================================
//
// AFKEating処理 [ afkeating.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afkeating.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "particle.h"
#include "player.h"
#include "gamesceneobject.h"

//*********************************************************
// 名前空間(飲食スペースでのさぼり)
//*********************************************************
namespace AFKEATING
{
	const D3DXVECTOR3 Pos = { -195.0f, 14.0, -202.0f };	// 位置
	constexpr float fRadius = 5.0f;						// 範囲の半径
};

//=========================================================
// コンストラクタ
//=========================================================
CAfkEating::CAfkEating()
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfkEating::~CAfkEating()
{

}

//=========================================================
// 生成処理
//=========================================================
CAfkEating* CAfkEating::Create(const D3DXVECTOR3& pos)
{
	// インスタンス生成
	CAfkEating* pAfkEating = new CAfkEating;
	if (pAfkEating == nullptr) return nullptr;

	// オブジェクトセット
	pAfkEating->SetPos(AFKEATING::Pos);

	// 初期化失敗時
	if (FAILED(pAfkEating->Init())) return nullptr;

	// ポインタを返す
	return pAfkEating;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfkEating::Init(void)
{
	// 親クラスの初期化処理
	CAfk::Init(AFKEATING::Pos, AFKEATING::fRadius);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfkEating::Uninit(void)
{
	// 親クラスの終了処理
	CAfk::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CAfkEating::Update(void)
{
	// 親クラスの更新処理
	CAfk::Update();
}