//=========================================================
//
// AFKGameCenter処理 [ afkgamecenter.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afkgamecenter.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace AFKGAMECENTER
{
	const D3DXVECTOR3 Pos = { 1705.0f, 0.0f, 166.0f };	// 位置
	constexpr float fRadius = 3.0f;						// 範囲の半径
};

//=========================================================
// コンストラクタ
//=========================================================
CAfkGameCenter::CAfkGameCenter()
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfkGameCenter::~CAfkGameCenter()
{

}

//=========================================================
// 生成処理
//=========================================================
CAfkGameCenter* CAfkGameCenter::Create(const D3DXVECTOR3& pos)
{
	// インスタンス生成
	CAfkGameCenter* pAfkSmoke = new CAfkGameCenter;
	if (pAfkSmoke == nullptr) return nullptr;

	// オブジェクトセット
	pAfkSmoke->SetPos(AFKGAMECENTER::Pos);

	// 初期化失敗時
	if (FAILED(pAfkSmoke->Init())) return nullptr;

	// ポインタを返す
	return pAfkSmoke;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfkGameCenter::Init(void)
{
	// 親クラスの初期化処理
	CAfk::Init(AFKGAMECENTER::Pos, AFKGAMECENTER::fRadius);
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfkGameCenter::Uninit(void)
{
	// 親クラスの終了処理
	CAfk::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CAfkGameCenter::Update(void)
{
	// 親クラスの更新処理
	CAfk::Update();
}