//=========================================================
//
// AFKMagazine処理 [ afkmagazine.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afkmagazine.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace AFKMAGAZINE
{
	const D3DXVECTOR3 Pos = { 250, 0.0f, 100.0f };		// さぼりの範囲
	const D3DXVECTOR3 Size = { 200.0f, 50.0f, 200.0f };	// 範囲の半径
};

//=========================================================
// コンストラクタ
//=========================================================
CAfkMagazine::CAfkMagazine()
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfkMagazine::~CAfkMagazine()
{

}

//=========================================================
// 生成処理
//=========================================================
CAfkMagazine* CAfkMagazine::Create(const D3DXVECTOR3& pos)
{
	// インスタンス生成
	CAfkMagazine* pAfkSmoke = new CAfkMagazine;
	if (pAfkSmoke == nullptr) return nullptr;

	// オブジェクトセット
	pAfkSmoke->SetPos(AFKMAGAZINE::Pos);
	pAfkSmoke->SetSize(AFKMAGAZINE::Size);

	// 初期化失敗時
	if (FAILED(pAfkSmoke->Init())) return nullptr;

	// チュートリアルUIのポインタを返す
	return pAfkSmoke;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfkMagazine::Init(void)
{
	SetSize(AFKMAGAZINE::Size);

	// 親クラスの初期化処理
	CAfk::Init(AFKMAGAZINE::Pos, NULL, CAfk::COLLISION::BOX);
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfkMagazine::Uninit(void)
{
	// 親クラスの終了処理
	CAfk::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CAfkMagazine::Update(void)
{
	// 親クラスの更新処理
	CAfk::Update();
}