//=========================================================
//
// AfkManager処理 [ afkmanager.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afkmanager.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "afksmoke.h"
#include "afktv.h"

//=================================================
// 静的メンバ変数
//=================================================
CAfkManager* CAfkManager::m_pInstance = nullptr; // インスタンス変数

//=========================================================
// コンストラクタ
//=========================================================
CAfkManager::CAfkManager() : m_pAfkSmoke(nullptr),
m_pAfkTV(nullptr)
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfkManager::~CAfkManager()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfkManager::Init(void)
{
	// たばこさぼりの初期化処理
	m_pAfkSmoke = new CAfksmoke;
	m_pAfkSmoke->Init();

	// テレビさぼりの初期化処理
	m_pAfkTV = new CAfkTV;
	m_pAfkTV->Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfkManager::Uninit(void)
{
	// たばこさぼりの破棄処理
	if (m_pAfkSmoke)
	{
		m_pAfkSmoke->Uninit();
		delete m_pAfkSmoke;
		m_pAfkSmoke = nullptr;
	}

	// テレビさぼりの破棄処理
	if (m_pAfkTV)
	{
		m_pAfkTV->Uninit();
		delete m_pAfkTV;
		m_pAfkTV = nullptr;
	}

	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}
//=========================================================
// 更新処理
//=========================================================
void CAfkManager::Update(void)
{
	// たばこさぼりの更新処理
	m_pAfkSmoke->Update();

	// テレビさぼりの更新処理
	m_pAfkTV->Update();

}
//=========================================================
// インスタンス取得処理
//=========================================================
CAfkManager* CAfkManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)m_pInstance = new CAfkManager;

	// 生成されたインスタンスを返す
	return m_pInstance;
}