//=========================================================
//
// AFKたばこ処理 [ afksmoke.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afksmoke.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "spherecollider.h"
#include "collisionsphere.h"

//=================================================
// 静的メンバ変数
//=================================================
CAfksmoke* CAfksmoke::m_pInstance = nullptr; // インスタンス変数

//*********************************************************
// 名前空間
//*********************************************************
namespace AFKSMOKE
{
	const D3DXVECTOR3 Pos = { 295.0f, 0.0f, 325.0f };	// たばこさぼりの範囲
	constexpr float fRadius = 25.0f;					// 範囲の半径
};

//=========================================================
// コンストラクタ
//=========================================================
CAfksmoke::CAfksmoke()
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfksmoke::~CAfksmoke()
{

}

//=========================================================
// 生成処理
//=========================================================
CAfksmoke* CAfksmoke::Create(const D3DXVECTOR3& pos)
{
	// インスタンス生成
	CAfksmoke* pAfkSmoke = new CAfksmoke;
	if (pAfkSmoke == nullptr) return nullptr;

	// オブジェクトセット
	pAfkSmoke->SetPos(AFKSMOKE::Pos);
	pAfkSmoke->SetRadius(AFKSMOKE::fRadius);

	// 初期化失敗時
	if (FAILED(pAfkSmoke->Init())) return nullptr;

	// チュートリアルUIのポインタを返す
	return pAfkSmoke;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfksmoke::Init(void)
{
	// 親クラスの初期化処理
	CAfk::Init(AFKSMOKE::Pos,AFKSMOKE::fRadius);
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfksmoke::Uninit(void)
{
	// 親クラスの終了処理
	CAfk::Uninit();

	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}
//=========================================================
// 更新処理
//=========================================================
void CAfksmoke::Update(void)
{
	// 親クラスの更新処理
	CAfk::Update();
}
//=================================================
// インスタンス取得処理
//=================================================
CAfksmoke* CAfksmoke::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)m_pInstance = new CAfksmoke;

	// 生成されたインスタンスを返す
	return m_pInstance;
}