//=========================================================
//
// AFKたばこ処理 [ afksmoke.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afksmoke.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "spherecollider.h"
#include "collisionsphere.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace UI
{

};

//=========================================================
// コンストラクタ
//=========================================================
CAfksmoke::CAfksmoke()
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfksmoke::~CAfksmoke()
{

}

//=========================================================
// 生成処理
//=========================================================
CAfksmoke* CAfksmoke::Create(const D3DXVECTOR3& pos, const float& fRadius)
{
	// インスタンス生成
	CAfksmoke* pAfkSmoke = new CAfksmoke;
	if (pAfkSmoke == nullptr) return nullptr;

	// オブジェクトセット
	pAfkSmoke->SetPos(pos);
	pAfkSmoke->SetRadius(fRadius);

	// 初期化失敗時
	if (FAILED(pAfkSmoke->Init())) return nullptr;

	// チュートリアルUIのポインタを返す
	return pAfkSmoke;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfksmoke::Init(void)
{
	// 親クラスの初期化処理
	CAfk::Init();
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfksmoke::Uninit(void)
{
	// 親クラスの終了処理
	CAfk::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CAfksmoke::Update(void)
{
	// 親クラスの更新処理
	CAfk::Update();

	

}