//=========================================================
//
// AfkUIManager処理 [ afkuimanager.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "afkuimanager.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "smokeui.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace AfkUIManager
{
	const D3DXVECTOR3 SmokeUIPos = { 295.0f, 75.0f, 325.0f };			// たばこ用UIの座標
	constexpr const char* SmokeUI_NAME = "smoking.png";					// たばこUIのテクスチャ名
};

//=================================================
// 静的メンバ変数
//=================================================
CAfkUIManager* CAfkUIManager::m_pInstance = nullptr; // インスタンス変数

//=========================================================
// コンストラクタ
//=========================================================
CAfkUIManager::CAfkUIManager()
{

}

//=========================================================
// デストラクタ
//=========================================================
CAfkUIManager::~CAfkUIManager()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CAfkUIManager::Init(void)
{
	// たばこ用UIの生成
	CSmokeUI::Create(AfkUIManager::SmokeUIPos, VECTOR3_NULL, AfkUIManager::SmokeUI_NAME);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CAfkUIManager::Uninit(void)
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}
//=========================================================
// 更新処理
//=========================================================
void CAfkUIManager::Update(void)
{

}
//=========================================================
// インスタンス取得処理
//=========================================================
CAfkUIManager* CAfkUIManager::Instance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)m_pInstance = new CAfkUIManager;

	// 生成されたインスタンスを返す
	return m_pInstance;
}