//=========================================================
//
// 社長通常状態クラス [ bossstateneutral.cpp ]
// Author : Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "bossstateneutral.h"

//*********************************************************
// ステート分岐クラスインクルード
//*********************************************************
// #include "bossstatedoubt.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "boss.h"
#include "manager.h"
#include "billboard.h"
#include "bossstatedoubt.h"

//=========================================================
// コンストラクタ
//=========================================================
CBossStateNeutral::CBossStateNeutral()
{
	SetID(ID_NEUTRAL);
}
//=========================================================
// デストラクタ
//=========================================================
CBossStateNeutral::~CBossStateNeutral()
{

}
//=========================================================
// 状態開始
//=========================================================
void CBossStateNeutral::OnStart()
{
	// ニュートラルモーション
	m_pBoss->GetMotion()->SetMotion(CBoss::MOTION::NEUTRAL, true, 3);
}
//=========================================================
// 状態更新
//=========================================================
void CBossStateNeutral::OnUpdate()
{
	// nullなら
	if (!m_pBoss) return;

	// フラグoff
	const auto& icon = m_pBoss->GetChaseIcon();
	if (icon)
		icon->SetDrawFlags(false);

	// 通常移動とオフィス内移動
	m_pBoss->NormalMoving();

	// 視界内 かつ オフィス内移動の時
	if (m_pBoss->CheckRayToAngleRange() && m_pBoss->GetInOfficeFlag() == true)
	{
		// 疑いステート生成
		m_pBoss->ChangeState(new CBossStateDoubt(), ID_DOUBT);
		return;
	}
}
//=========================================================
// 状態終了
//=========================================================
void CBossStateNeutral::OnExit()
{

}