//=========================================================
//
// コピー機用UI処理 [ copyui.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "copyui.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "texture.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace CopyUI
{
	constexpr float fWidth = 15.0f;		// UIの横幅の値
	constexpr float fHeight = 15.0f;	// UIの縦幅の値
	constexpr float fRadius = 65.0f;	// UIの範囲表示の半径の値
};

//=========================================================
// コンストラクタ
//=========================================================
CCopyUI::CCopyUI(int nPriority) : CTutorialUI(nPriority)
{

}

//=========================================================
// デストラクタ
//=========================================================
CCopyUI::~CCopyUI()
{

}

//=========================================================
// 生成処理
//=========================================================
CCopyUI* CCopyUI::Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot, const char* pTexName)
{
	// インスタンス生成
	CCopyUI* pCopyUI = new CCopyUI;
	if (pCopyUI == nullptr) return nullptr;

	// オブジェクトセット
	pCopyUI->SetPos(pos);
	pCopyUI->SetSize(CopyUI::fWidth, CopyUI::fHeight);
	pCopyUI->SetRot(rot);
	pCopyUI->SetRadius(CopyUI::fRadius);
	pCopyUI->SetTexture(pTexName);
	pCopyUI->SetEnableZtest(true);

	// 初期化失敗時
	if (FAILED(pCopyUI->Init())) return nullptr;

	// チュートリアルUIのポインタを返す
	return pCopyUI;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CCopyUI::Init(void)
{
	// 親クラスの初期化処理
	CTutorialUI::Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CCopyUI::Uninit(void)
{
	// 親クラスの終了処理
	CTutorialUI::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CCopyUI::Update(void)
{
	// 親クラスの更新処理
	CTutorialUI::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CCopyUI::Draw(void)
{
	// 親クラスの描画処理
	CTutorialUI::Draw();
}