//=========================================================
//
// タスク処理 [ deskwork.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "deskwork.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CDeskwork::CDeskwork(int nPriority): CObject2D(nPriority),
m_pos(VECTOR3_NULL)
{

}

//=========================================================
// デストラクタ
//=========================================================
CDeskwork::~CDeskwork()
{


}

//=========================================================
// 生成処理処理
//=========================================================
CDeskwork* CDeskwork::Create(const D3DXVECTOR3& pos)
{
	// インスタンス生成
	CDeskwork* pDeskwork = new CDeskwork;

	// ヌルチェック
	if (pDeskwork == nullptr) return nullptr;

	// 各種値の設定
	pDeskwork->SetPos(pos);

	// 初期化が失敗した場合
	if (FAILED(pDeskwork->Init())) return nullptr;

	return pDeskwork;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT CDeskwork::Init(void)
{
	// 背景の各種設定
	SetSize(Config::WIDTH, Config::HEIGHT);	// サイズ設定
	SetCol(COLOR_WHITE);					// カラー設定
	SetTexture(Config::TEXNAME);			// テクスチャ設定

	// UIを生成
	for (int nCount = 0;nCount < Config::UI_WORK;nCount++)
	{

	}

	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CDeskwork::Uninit(void)
{

}

//=========================================================
// 更新処理
//=========================================================
void CDeskwork::Update(void)
{

}

//=========================================================
// 描画処理
//=========================================================
void CDeskwork::Draw(void)
{

}