//=========================================================
//
// タスクUI処理 [ deskworkUI.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "deskworkUI.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CDeskworkUI::CDeskworkUI(int nPriority) : CObject2D(nPriority),
m_pos(VECTOR3_NULL)
{

}

//=========================================================
// デストラクタ
//=========================================================
CDeskworkUI::~CDeskworkUI()
{


}

//=========================================================
// 生成処理処理
//=========================================================
CDeskworkUI* CDeskworkUI::Create(const D3DXVECTOR3& pos, const float& fWidth, const float& fHeight, const KEYTYPE& kyetype)
{
	// インスタンス生成
	CDeskworkUI* pDeskworkUI = new CDeskworkUI;

	// ヌルチェック
	if (pDeskworkUI == nullptr) return nullptr;

	// 各種値の設定
	pDeskworkUI->SetPos(pos);
	pDeskworkUI->SetSize(fWidth, fHeight);
	pDeskworkUI->SetKyeType(kyetype);

	// 初期化が失敗した場合
	if (FAILED(pDeskworkUI->Init())) return nullptr;

	return pDeskworkUI;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT CDeskworkUI::Init(void)
{
	// タスクUIの各種設定
	SetCol(COLOR_WHITE);			// カラー設定
	SetTexture(Config::TEXNAME);	// テクスチャ設定


	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CDeskworkUI::Uninit(void)
{

}

//=========================================================
// 更新処理
//=========================================================
void CDeskworkUI::Update(void)
{

}

//=========================================================
// 描画処理
//=========================================================
void CDeskworkUI::Draw(void)
{

}