//=========================================================
//
// デスク管理処理 [ deskmanager.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "deskmanager.h"

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include "json.hpp"
#include <fstream>
#include <iostream>
#include <sstream>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "jsonmanager.h"
#include "manager.h"

//*********************************************************
// 使用名前空間
//*********************************************************
using json = nlohmann::json;

//=========================================================
// コンストラクタ
//=========================================================
CDeskManager::CDeskManager() : m_pDesks{}
{

}
//=========================================================
// デストラクタ
//=========================================================
CDeskManager::~CDeskManager()
{
	Uninit();
}
//=========================================================
// デスク生成関数
//=========================================================
CDesk* CDeskManager::CreateManager
(
	const D3DXVECTOR3& pos,
	const D3DXVECTOR3& rot,
	const D3DXVECTOR3& scale,
	const char* pModelName
)
{
	// インスタンス生成
	CDesk* pNewDesk = CDesk::Create(pos, rot, scale, pModelName);

	// 配列に追加
	if (pNewDesk) m_pDesks.push_back(pNewDesk);

	return pNewDesk;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CDeskManager::Init(void)
{
	// 配列のクリア
	m_pDesks.clear();

	// ファイル読み込み
	Load();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CDeskManager::Uninit(void)
{
	// 配列のクリア
	m_pDesks.clear();
}
//=========================================================
// 更新処理
//=========================================================
void CDeskManager::Update(void)
{

}
//=========================================================
// json読み込み
//=========================================================
HRESULT CDeskManager::Load(void)
{
	// jsonファイル読み込み
	auto jsonmanager = CManager::GetInstance()->GetJsonManager();
	jsonmanager->Load(FILE_NAME);

	return S_OK;
}