//=========================================================
//
// 敵の複数管理クラス [ enemymanager.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "enemymanager.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemy.h"

//=========================================================
// コンストラクタ
//=========================================================
CEnemyManager::CEnemyManager() : m_pEnemys{},
m_nStageCount(NULL)
{

}
//=========================================================
// デストラクタ
//=========================================================
CEnemyManager::~CEnemyManager()
{
	Uninit();
}
//=========================================================
// 実際の生成処理
//=========================================================
CEnemy* CEnemyManager::CreateManager(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot)
{
	// インスタンス生成
	CEnemy* pEnemy = CEnemy::Create(pos,rot);

	// 動的配列内追加
	if (pEnemy)
	{
		m_pEnemys.push_back(pEnemy);
	}

	// デフォルトで返す
	return pEnemy;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CEnemyManager::Init(void)
{
	// 配列の切り離し
	m_pEnemys.clear();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CEnemyManager::Uninit(void)
{
	// 配列クリア
	m_pEnemys.clear();
}
//=========================================================
// 更新処理
//=========================================================
void CEnemyManager::Update(void)
{
	// カウント加算
	m_nStageCount++;
}