//=========================================================
//
// 敵の通常状態クラス [ enemystateneutral.cpp ]
// Author : Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "enemystateneutral.h"
#include "enemystateserch.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemy.h"
#include "manager.h"
#include "input.h"

//=========================================================
// コンストラクタ
//=========================================================
CEnemyStateNeutral::CEnemyStateNeutral()
{
	SetID(ID_NEUTRAL);
}
//=========================================================
// デストラクタ
//=========================================================
CEnemyStateNeutral::~CEnemyStateNeutral()
{

}
//=========================================================
// 状態開始
//=========================================================
void CEnemyStateNeutral::OnStart()
{
	// モーションセット
	m_pEnemy->GetMotion()->SetMotion(CEnemy::MOTION::NEUTRAL, true, 5);
}
//=========================================================
// 状態更新
//=========================================================
void CEnemyStateNeutral::OnUpdate()
{
	// nullなら
	if (!m_pEnemy) return;

	// 通常のポインタ移動をする
	m_pEnemy->UpdateMoveViewPoint();

	// もし索敵範囲に入っていたら、疑い状態に変更する
	if (m_pEnemy->CheckEyesight())
	{
		// ステート生成
		//m_pEnemy->ChangeState(new);
	}
}
//=========================================================
// 状態終了
//=========================================================
void CEnemyStateNeutral::OnExit()
{

}