//=========================================================
//
// セリフ処理 [ lines.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "lines.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CLines::CLines(int nPriority) :CObject2D(nPriority),
m_bUse(false)
{

}

//=========================================================
// デストラクタ
//=========================================================
CLines::~CLines()
{

}

//=========================================================
// 生成処理
//=========================================================
CLines* CLines::Create(const D3DXVECTOR3& pos, const D3DXVECTOR2& size)
{
	// 生成
	CLines* pLines = new CLines;

	// ヌルチェック
	if (pLines == nullptr) return nullptr;

	// 各種値の設定
	pLines->SetPos(pos);
	pLines->SetSize(size.x, size.y);			// サイズ設定
	pLines->SetCol(COLOR_WHITE);				// カラー設定
	pLines->SetTexture(Config::SERIHU_001);		// テクスチャ設定

	// 初期化が失敗した時
	if (FAILED(pLines->Init())) return nullptr;

	return pLines;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT CLines::Init(void)
{
	// 親の初期化処理
	CObject2D::Init();

	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CLines::Uninit(void)
{
	// 親の終了処理
	CObject2D::Uninit();

}

//=========================================================
// 更新処理
//=========================================================
void CLines::Update(void)
{
	// 描画していない状態なら
	if (m_bUse != true) return;

	// 親の更新処理
	CObject2D::Update();

}

//=========================================================
// 描画処理
//=========================================================
void CLines::Draw(void)
{
	// 描画していない状態なら
	if (m_bUse != true) return;

	// 親の描画処理
	CObject2D::Draw();

}