//=========================================================
//
// 外出タスク処理 [ outsidework.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "outsidework.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "input.h"
#include "score.h"
#include "progressgauge.h"
#include "gaugeneedle.h"
#include "gamesceneobject.h"
#include "titleuimanager.h"
#include "tutorialobject.h"
#include "tutoriallines.h"
#include "particle.h"

//=========================================================
// コンストラクタ
//=========================================================
COutsideWork::COutsideWork() :CDeskworkUIManager()
{

}

//=========================================================
// デストラクタ
//=========================================================
COutsideWork::~COutsideWork()
{

}

//=========================================================
// 生成処理処理
//=========================================================
COutsideWork* COutsideWork::Create(const bool& bUse)
{
	// 外タスクのポインタ
	static COutsideWork pDOCUMENTDeskwork;

	// 設定処理
	pDOCUMENTDeskwork.SetUse(bUse);

	// 初期化が失敗した場合
	if (FAILED(pDOCUMENTDeskwork.Init())) return nullptr;

	return &pDOCUMENTDeskwork;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT COutsideWork::Init(void)
{

	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void COutsideWork::Uninit(void)
{

}

//=========================================================
// 更新処理
//=========================================================
void COutsideWork::Update(void)
{

}

//=========================================================
// 描画処理
//=========================================================
void COutsideWork::Draw(void)
{

}
