//=========================================================
//
// 過労死シーンのリソース管理処理 [ overworkresultmanager.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "overworkresultmanager.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "sound.h"

//=========================================================
// コンストラクタ
//=========================================================
COverWorkResultManager::COverWorkResultManager()
{

}
//=========================================================
// デストラクタ
//=========================================================
COverWorkResultManager::~COverWorkResultManager()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT COverWorkResultManager::Init(void)
{
	// サウンド取得
	CSound* pSound = CManager::GetInstance()->GetSound();
	if (pSound == nullptr) return E_FAIL;

	// 実際の再生
	//pSound->Play(SOUND_LABEL_OVERWORK_BGM);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void COverWorkResultManager::Uninit(void)
{

}
//=========================================================
// 更新処理
//=========================================================
void COverWorkResultManager::Update(void)
{

}