//=========================================================
//
// PC用UI処理 [ pcui.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "pcui.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "texture.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace PcUI
{
	constexpr float fWidth = 15.0f;		// UIの横幅の値
	constexpr float fHeight = 15.0f;	// UIの縦幅の値
	constexpr float fRadius = 45.0f;	// UIの範囲表示の半径の値
};

//=========================================================
// コンストラクタ
//=========================================================
CPcUI::CPcUI(int nPriority) : CTutorialUI(nPriority)
{

}

//=========================================================
// デストラクタ
//=========================================================
CPcUI::~CPcUI()
{

}

//=========================================================
// 生成処理
//=========================================================
CPcUI* CPcUI::Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot, const char* pTexName)
{
	// インスタンス生成
	CPcUI* pCpUI = new CPcUI;
	if (pCpUI == nullptr) return nullptr;

	// オブジェクトセット
	pCpUI->SetPos(pos);
	pCpUI->SetSize(PcUI::fWidth, PcUI::fHeight);
	pCpUI->SetRot(rot);
	pCpUI->SetRadius(PcUI::fRadius);
	pCpUI->SetTexture(pTexName);
	pCpUI->SetEnableZtest(true);

	// 初期化失敗時
	if (FAILED(pCpUI->Init())) return nullptr;

	// チュートリアルUIのポインタを返す
	return pCpUI;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CPcUI::Init(void)
{
	// 親クラスの初期化処理
	CTutorialUI::Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CPcUI::Uninit(void)
{
	// 親クラスの終了処理
	CTutorialUI::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CPcUI::Update(void)
{
	// 親クラスの更新処理
	CTutorialUI::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CPcUI::Draw(void)
{
	// 親クラスの描画処理
	CTutorialUI::Draw();
}