//=========================================================
//
// プレイヤーステートニュートラルクラス処理 [ playerstateneutral.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "playerstateneutral.h"
#include "playerstatemove.h"
#include "player.h"
#include "manager.h"
#include "input.h"

//=========================================================
// コンストラクタ
//=========================================================
CPlayerStateNeutral::CPlayerStateNeutral()
{
	SetID(ID_NEUTRAL);
}

//=========================================================
// デストラクタ
//=========================================================
CPlayerStateNeutral::~CPlayerStateNeutral()
{

}

//=========================================================
// 状態開始
//=========================================================
void CPlayerStateNeutral::OnStart()
{
	m_pPlayer->GetMotion()->SetMotion(CPlayer::MOTION::NEUTRAL,true,5);
}

//=========================================================
// 状態更新
//=========================================================
void CPlayerStateNeutral::OnUpdate()
{
	// 移動判定がtrueだったら
	if (m_pPlayer->GetMoveCheck())
	{
		// ステートを移動にチェンジ
		m_pPlayer->ChangeState(new CPlayerStateMove(), ID_MOVE);
	}
}

//=========================================================
// 状態終了
//=========================================================
void CPlayerStateNeutral::OnExit()
{

}