//=========================================================
//
// プレイヤーステートムーブクラス処理 [ playerstatemove.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "playerstatemove.h"
#include "playerstateneutral.h"
#include "player.h"

//=========================================================
// コンストラクタ
//=========================================================
CPlayerStateMove::CPlayerStateMove()
{
	SetID(ID_MOVE);
}

//=========================================================
// デストラクタ
//=========================================================
CPlayerStateMove::~CPlayerStateMove()
{

}

//=========================================================
// 状態開始
//=========================================================
void CPlayerStateMove::OnStart()
{
	m_pPlayer->GetMotion()->SetMotion(CPlayer::MOTION::MOVE);
}

//=========================================================
// 状態更新
//=========================================================
void CPlayerStateMove::OnUpdate()
{
	if (!m_pPlayer->GetMoveCheck())
	{
		// ステートを移動にチェンジ
		m_pPlayer->ChangeState(new CPlayerStateNeutral(), ID_NEUTRAL);
	}
}

//=========================================================
// 状態終了
//=========================================================
void CPlayerStateMove::OnExit()
{

}