//=========================================================
//
// TV見ているサボりの状態クラス処理 [ playerstatetv.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "playerstatetv.h"
#include "playerstateneutral.h"
#include "player.h"

//*********************************************************
// 定数名前空間
//*********************************************************
namespace PlayerTV
{
	const D3DXVECTOR3 ReturnPos = { -253.0f,0.0f,316.0f };  // もどる固定座標
};

//=========================================================
// コンストラクタ
//=========================================================
CPlayerStateTV::CPlayerStateTV()
{
	SetID(ID_TV);
}
//=========================================================
// デストラクタ
//=========================================================
CPlayerStateTV::~CPlayerStateTV()
{

}
//=========================================================
// 開始関数
//=========================================================
void CPlayerStateTV::OnStart(void)
{
	// プレイヤーの現在座標を椅子の上にセットする
	m_pPlayer->MathTVRotation();
}
//=========================================================
// 更新関数
//=========================================================
void CPlayerStateTV::OnUpdate(void)
{
	// モーションが違ったら
	if (m_pPlayer->TV != m_pPlayer->GetMotion()->GetMotionType())
	{
		// モーション変更
		m_pPlayer->GetMotion()->SetMotion(CPlayer::MOTION::TV, true, 5);
	}

	if (!m_pPlayer->GetAfkTV())
	{
		// 状態遷移
		m_pPlayer->ChangeState(new CPlayerStateNeutral(), ID_NEUTRAL);
	}
}
//=========================================================
// 終了関数
//=========================================================
void CPlayerStateTV::OnExit(void)
{
	// 固定の座標にもどる
	m_pPlayer->SetPos(PlayerTV::ReturnPos);
}