//=========================================================
//
// プレイヤーステート基底クラス処理 [ playerstatebase.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// 静的メンバ変数
//*********************************************************
CPlayerStateBase* CPlayerStateBase::m_pInstance = nullptr; // インスタンス変数

//=========================================================
// コンストラクタ
//=========================================================
CPlayerStateBase::CPlayerStateBase() : m_pPlayer(nullptr),
m_nID(NULL)
{

}

//=========================================================
// デストラクタ
//=========================================================
CPlayerStateBase::~CPlayerStateBase()
{
	// シングルトンの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=========================================================
// インスタンス取得処理
//=========================================================
CPlayerStateBase* CPlayerStateBase::GetInstance(void)
{
	// nullチェック
	if (m_pInstance == nullptr)
		m_pInstance = new CPlayerStateBase;

	// 生成されたインスタンスを返す
	return m_pInstance;
}