//=========================================================
//
// プレイヤーステートディッチクラス処理 [ playerstateditch.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "playerstateditch.h"
#include "playerstateneutral.h"
#include "player.h"

//=========================================================
// コンストラクタ
//=========================================================
CPlayerStateDitch::CPlayerStateDitch()
{
	SetID(ID_MOVE);
}

//=========================================================
// デストラクタ
//=========================================================
CPlayerStateDitch::~CPlayerStateDitch()
{

}

//=========================================================
// 状態開始
//=========================================================
void CPlayerStateDitch::OnStart()
{
	m_pPlayer->GetMotion()->SetMotion(CPlayer::MOTION::SMOKE);
}

//=========================================================
// 状態更新
//=========================================================
void CPlayerStateDitch::OnUpdate()
{
	if (!m_pPlayer->GetMoveCheck())
	{
		// ステートを移動にチェンジ
		m_pPlayer->ChangeState(new CPlayerStateNeutral(), ID_NEUTRAL);
	}
}

//=========================================================
// 状態終了
//=========================================================
void CPlayerStateDitch::OnExit()
{

}