//=========================================================
//
// ランキングの横棒グラフ処理 [ rankingglaph.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "rankinggraph.h"
#include <algorithm>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "load.h"

//=========================================================
// コンストラクタ
//=========================================================
CRankingGraph::CRankingGraph(int nPriority) : CObject2D(nPriority)
{

}
//=========================================================
// デストラクタ
//=========================================================
CRankingGraph::~CRankingGraph()
{

}
//=========================================================
// 生成処理
//=========================================================
CRankingGraph* CRankingGraph::Create(const D3DXVECTOR3& pos, float fWidth, float fHeight)
{
	// インスタンス生成
	CRankingGraph* pGraph = new CRankingGraph;
	if (pGraph == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pGraph->Init())) return nullptr;

	// オブジェクト設定
	pGraph->SetPos(pos);
	pGraph->SetSize(fWidth, fHeight);
	pGraph->SetAnchor(CObject2D::ANCHORTYPE_LEFTSIDE);
	pGraph->SetCol();
	pGraph->SetTexture("build008.png");

	return pGraph;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CRankingGraph::Init(void)
{
	// 親クラスの初期化
	CObject2D::Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CRankingGraph::Uninit(void)
{
	// 親クラスの終了処理
	CObject2D::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CRankingGraph::Update(void)
{
	// 親クラスの更新処理
	CObject2D::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CRankingGraph::Draw(void)
{
	// 親クラスの描画処理
	CObject2D::Draw();
}