//=========================================================
//
// リザルトのキャラクター管理クラス [ resultcastmanager.cpp ]
// Author: Asuma Nishio
// 
// NOTE : 場所は上司のデスク前とかにしようかな
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "resultcastmanager.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "resultlazycast.h"
#include "jsonmanager.h"
#include "manager.h"

//*********************************************************
// 定数名前空間
//*********************************************************
namespace CAST_MANAGER
{
	constexpr const char* FILE = "data/Json/ResultCast.json"; // 外部ファイル
};

//=========================================================
// コンストラクタ
//=========================================================
CResultCastManager::CResultCastManager() : m_pCasts{}
{

}
//=========================================================
// デストラクタ
//=========================================================
CResultCastManager::~CResultCastManager()
{
	Uninit();
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CResultCastManager::Init(void)
{
	// 配列の切り離し
	m_pCasts.clear();

	// jsonmanagerを取得
	const auto& json = CManager::GetInstance()->GetJsonManager();

	// キャラクターを実際に読み込む
	json->Load(CAST_MANAGER::FILE);
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CResultCastManager::Uninit(void)
{
	// 配列クリア
	m_pCasts.clear();
}
//=========================================================
// 更新処理
//=========================================================
void CResultCastManager::Update(void)
{

}