//=========================================================
//
// コピー機用UI処理 [ copyui.cpp ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "smokeui.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "texture.h"

//*********************************************************
// 名前空間
//*********************************************************
namespace SmokeUI
{
	constexpr float fWidth = 15.0f;		// UIの横幅の値
	constexpr float fHeight = 15.0f;	// UIの縦幅の値
	constexpr float fRadius = 65.0f;	// UIの範囲表示の半径の値
};

//=========================================================
// コンストラクタ
//=========================================================
CSmokeUI::CSmokeUI(int nPriority) : CAfkUI(nPriority)
{

}

//=========================================================
// デストラクタ
//=========================================================
CSmokeUI::~CSmokeUI()
{

}

//=========================================================
// 生成処理
//=========================================================
CSmokeUI* CSmokeUI::Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot, const char* pTexName)
{
	// インスタンス生成
	CSmokeUI* pSmokeUI = new CSmokeUI;
	if (pSmokeUI == nullptr) return nullptr;

	// オブジェクトセット
	pSmokeUI->SetPos(pos);
	pSmokeUI->SetSize(SmokeUI::fWidth, SmokeUI::fHeight);
	pSmokeUI->SetRot(rot);
	pSmokeUI->SetRadius(SmokeUI::fRadius);
	pSmokeUI->SetTexture(pTexName);
	pSmokeUI->SetEnableZtest(true);

	// 初期化失敗時
	if (FAILED(pSmokeUI->Init())) return nullptr;

	// チュートリアルUIのポインタを返す
	return pSmokeUI;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CSmokeUI::Init(void)
{
	// 親クラスの初期化処理
	CAfkUI::Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CSmokeUI::Uninit(void)
{
	// 親クラスの終了処理
	CAfkUI::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CSmokeUI::Update(void)
{
	// 親クラスの更新処理
	CAfkUI::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CSmokeUI::Draw(void)
{
	// 親クラスの描画処理
	CAfkUI::Draw();
}