//=========================================================
//
// ステートマシンクラス処理 [ statemachine.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "statemachine.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "statebase.h"

//=========================================================
// コンストラクタ
//=========================================================
CStateMachine::CStateMachine() : m_pNowState(nullptr)
{

}
//=========================================================
// デストラクタ
//=========================================================
CStateMachine::~CStateMachine()
{

}
//=========================================================
// 更新処理
//=========================================================
void CStateMachine::Update(void)
{
	// nullptrじゃなかったら
	if (m_pNowState != nullptr)
	{
		// 更新開始
		m_pNowState->OnUpdate();
	}
}
//=========================================================
// ステート変更関数
//=========================================================
void CStateMachine::ChangeState(CStateBase* pNewState)
{
	// ポインタが存在するとき
	if (m_pNowState != nullptr && pNewState != nullptr)
	{
		// ID が同じなら
		if (m_pNowState->GetID() == pNewState->GetID())
		{
			delete pNewState;
			return;
		}
	}

	// すでにステートがセットされてたら終了する
	if (m_pNowState != nullptr)
	{
		// 終了
		m_pNowState->OnExit();
		delete m_pNowState;
		m_pNowState = nullptr;
	}

	// 新しいステートをセットする
	m_pNowState = pNewState;

	// 新しいステートを開始する
	m_pNowState->OnStart();
}
//=========================================================
// 終了処理
//=========================================================
void CStateMachine::OnExit(void)
{
	// すでにステートがセットされてたら終了する
	if (m_pNowState != nullptr)
	{
		delete m_pNowState;
		m_pNowState = nullptr;
	}
}
//=========================================================
// IDを返す処理
//=========================================================
int CStateMachine::GetNowStateID(void)
{
	if (m_pNowState)
		return m_pNowState->GetID(); // 現在動いているIDを返す

	return 0; // ニュートラル
}