////=========================================================
////
//// タスクコマンド処理 [ taskcommand.cpp ]
//// Author: Takahashi Misaki
////
////=========================================================
//
////*********************************************************
//// クラス定義ヘッダーファイル
////*********************************************************
//#include "taskcommand.h"
//
////*********************************************************
//// インクルードファイル
////*********************************************************
//#include "manager.h"
//#include "input.h"
//
////=========================================================
//// コンストラクタ
////=========================================================
//CWCommand::CWCommand()
//{
//
//}
//
////=========================================================
//// デストラクタ
////=========================================================
//CWCommand::~CWCommand()
//{
//
//}
//
////=========================================================
//// 更新処理
////=========================================================
//bool CWCommand::Update(const CDeskworkUI* m_pDeskworkUI, int& nIdx)
//{
//	CInputKeyboard* pKeyboard = CManager::GetInstance()->GetInputKeyboard();
//
//	if (pKeyboard == nullptr)
//	{// ヌルチェック
//		return false;
//	}
//
//	if (pKeyboard->GetTrigger(DIK_W) == true && m_pDeskworkUI->GetKyeType() == CDeskworkUI::DRAWTYPE_W)
//	{// Wを押した時
//
//		// 次のタスクに移る
//		nIdx++;
//
//		return true;
//	}
//
//	return false;
//}
