//========================================================
//
// タイトルに出現するUIの処理 [ titleui.cpp ]
// Author: Asuma Nishio
//
//========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "titleui.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"

//========================================================
// コンストラクタ
//========================================================
CTitleUi::CTitleUi(int nPriority) : CObject2D(nPriority),
m_isUseFlag(false)
{

}
//========================================================
// デストラクタ
//========================================================
CTitleUi::~CTitleUi()
{

}
//========================================================
// 生成処理
//========================================================
CTitleUi* CTitleUi::Create
(
	const D3DXVECTOR3& pos, 
	const float& fWidth, 
	const float& fHeight, 
	const char* Filename,
	const bool& isUseSet
)
{
	// インスタンス生成
	CTitleUi* pUi = new CTitleUi;
	if (pUi == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pUi->Init())) return nullptr;

	// オブジェクト設定
	pUi->SetPos(pos);
	pUi->SetSize(fWidth, fHeight);
	pUi->SetTexture(Filename);
	pUi->SetAnchor();
	pUi->m_isUseFlag = isUseSet;

	return pUi;
}
//========================================================
// 初期化処理
//========================================================
HRESULT CTitleUi::Init(void)
{
	// 親クラスの初期化
	CObject2D::Init();

	return S_OK;
}
//========================================================
// 終了処理
//========================================================
void CTitleUi::Uninit(void)
{
	// 親クラスの終了処理
	CObject2D::Uninit();
}
//========================================================
// 更新処理
//========================================================
void CTitleUi::Update(void)
{
	// 親クラスの更新処理
	CObject2D::Update();
}
//========================================================
// 描画処理
//========================================================
void CTitleUi::Draw(void)
{
	// 親クラスの描画処理
	CObject2D::Draw();
}