//=========================================================
//
// タイトル管理処理 [ titlemanager.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "titlemanager.h"

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "input.h"
#include "sound.h"
#include "fade.h"
#include "game.h"

//=========================================================
// コンストラクタ
//=========================================================
CTitleManager::CTitleManager() : isKeyinputSet(false)
{
	
}
//=========================================================
// デストラクタ
//=========================================================
CTitleManager::~CTitleManager()
{

}
//==========================================================
//インスタンス取得
//==========================================================
CTitleManager* CTitleManager::GetInstance(void)
{
	// インスタンスを返す
	static CTitleManager pTitleManager;
	return &pTitleManager;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTitleManager::Init(void)
{
	// サウンド取得
	CSound* pSound = CManager::GetInstance()->GetSound();
	if (pSound == nullptr) return E_FAIL;

	// サウンド再生
	pSound->Play(CSound::SOUND_LABEL_TITLE_BGM);

	// フラグ初期化
	isKeyinputSet = false;

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CTitleManager::Uninit(void)
{

}
//=========================================================
// 更新処理
//=========================================================
void CTitleManager::Update(void)
{

}