//=========================================================
//
// タイトルで出現するオブジェクト処理 [ titleobject.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "titleobject.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "jsonmanager.h"
#include "titleuimanager.h"

//*********************************************************
// 静的メンバ変数宣言
//*********************************************************
CTitleObject* CTitleObject::m_pInstance = nullptr;					// シングルトン変数

//*********************************************************
// 定数宣言空間
//*********************************************************
namespace TITLEOBJECT
{
	constexpr const char* LoadName = "data/JSON/Titleobject.json";		// 読み込むjsonファイル
};

//=========================================================
// コンストラクタ
//=========================================================
CTitleObject::CTitleObject()
{
	
}
//=========================================================
// デストラクタ
//=========================================================
CTitleObject::~CTitleObject()
{
	
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTitleObject::Init(void)
{
	// タイトルで使うオブジェクトの読み込み
	auto JsonManager = CManager::GetInstance()->GetJsonManager();
	JsonManager->Load(TITLEOBJECT::LoadName);

	// タイトルの選択肢設定クラスの初期化
	CTitleuiManager::GetInstance()->Init();

	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CTitleObject::Uninit(void)
{
	// タイトルの選択肢設定クラスの終了処理
	CTitleuiManager::GetInstance()->Uninit();

	// インスタンスの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}

//=========================================================
// 更新処理
//=========================================================
void CTitleObject::Update(void)
{
	// タイトルの選択肢設定クラスの更新処理
	CTitleuiManager::GetInstance()->Update();
}

//=========================================================
// シングルトン取得処理
//=========================================================
CTitleObject* CTitleObject::GetInstance(void)
{
	// nullなら
	if (m_pInstance == nullptr) m_pInstance = new CTitleObject;

	// シングルトンを返す
	return m_pInstance;
}