//=========================================================
//
// チュートリアルのセリフ背景処理 [ tutoriallinesBG.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "tutoriallinesBG.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CTutorialLinesBG::CTutorialLinesBG(int nPriority) :CObject2D(nPriority)
{

}

//=========================================================
// デストラクタ
//=========================================================
CTutorialLinesBG::~CTutorialLinesBG()
{

}

//=========================================================
// 生成処理
//=========================================================
CTutorialLinesBG* CTutorialLinesBG::Create(const D3DXVECTOR3& pos)
{
	// 生成
	CTutorialLinesBG* pEventUI = new CTutorialLinesBG;

	// ヌルチェック
	if (pEventUI == nullptr) return nullptr;

	// 各種値の設定
	pEventUI->SetPos(pos);
	pEventUI->SetSize(Config::PC_WIDTH, Config::PC_HEIGHT);		// サイズ設定
	pEventUI->SetCol(COLOR_WHITE);								// カラー設定
	pEventUI->SetTexture(Config::PC_TEXNAME);					// テクスチャ設定

	// 初期化が失敗した時
	if (FAILED(pEventUI->Init())) return nullptr;

	return pEventUI;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT CTutorialLinesBG::Init(void)
{

	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CTutorialLinesBG::Uninit(void)
{

}

//=========================================================
// 更新処理
//=========================================================
void CTutorialLinesBG::Update(void)
{

}

//=========================================================
// 描画処理
//=========================================================
void CTutorialLinesBG::Draw(void)
{

}