//=========================================================
//
// チュートリアルのセリフ処理 [ tutoriallines.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "tutoriallines.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "tutoriallinesBG.h"

//=========================================================
// コンストラクタ
//=========================================================
CTutorialLines::CTutorialLines(int nPriority) :CObject(nPriority),
m_pBG(nullptr)
{

}

//=========================================================
// デストラクタ
//=========================================================
CTutorialLines::~CTutorialLines()
{

}

//=========================================================
// 生成処理
//=========================================================
CTutorialLines* CTutorialLines::Create(void)
{
	// 生成
	CTutorialLines* pEventUI = new CTutorialLines;

	// ヌルチェック
	if (pEventUI == nullptr) return nullptr;

	// 初期化が失敗した時
	if (FAILED(pEventUI->Init())) return nullptr;

	return pEventUI;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT CTutorialLines::Init(void)
{
	// 背景の生成処理
	m_pBG = CTutorialLinesBG::Create(D3DXVECTOR3(790.0f, SCREEN_HEIGHT * 0.87f, 0.0f));


	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CTutorialLines::Uninit(void)
{
	// 各ポインタの終了処理
	m_pBG->Uninit();

}

//=========================================================
// 更新処理
//=========================================================
void CTutorialLines::Update(void)
{
	// 各ポインタの更新処理
	m_pBG->Update();

}

//=========================================================
// 描画処理
//=========================================================
void CTutorialLines::Draw(void)
{
	// 各ポインタの描画処理
	m_pBG->Draw();

}