//=========================================================
//
// チュートリアルのセリフ処理 [ tutoriallines.cpp ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "tutoriallines.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "manager.h"
#include "tutoriallinesBG.h"

//=========================================================
// コンストラクタ
//=========================================================
CTutorialLines::CTutorialLines(int nPriority) :CObject(nPriority),
m_bUse(false),
m_pBG(nullptr)
{

}

//=========================================================
// デストラクタ
//=========================================================
CTutorialLines::~CTutorialLines()
{

}

//=========================================================
// 生成処理
//=========================================================
CTutorialLines* CTutorialLines::Create(const bool& bUse)
{
	// 生成
	CTutorialLines* pTutoriallines = new CTutorialLines;

	// ヌルチェック
	if (pTutoriallines == nullptr) return nullptr;

	// 引数の値を代入
	pTutoriallines->m_bUse = bUse;

	// 初期化が失敗した時
	if (FAILED(pTutoriallines->Init())) return nullptr;

	return pTutoriallines;
}

//=========================================================
// 初期化処理
//=========================================================
HRESULT CTutorialLines::Init(void)
{
	// 背景の生成処理
	m_pBG = CTutorialLinesBG::Create(D3DXVECTOR3(790.0f, SCREEN_HEIGHT * 0.87f, 0.0f));


	return S_OK;
}

//=========================================================
// 終了処理
//=========================================================
void CTutorialLines::Uninit(void)
{
	// 各ポインタの終了処理
	m_pBG->Uninit();

}

//=========================================================
// 更新処理
//=========================================================
void CTutorialLines::Update(void)
{
	// 描画していない状態なら
	if (m_bUse != true) return;

	// 各ポインタの更新処理
	m_pBG->Update();

}

//=========================================================
// 描画処理
//=========================================================
void CTutorialLines::Draw(void)
{
	// 描画していない状態なら
	if (m_bUse != true) return;

	// 各ポインタの描画処理
	m_pBG->Draw();

}