//=========================================================
//
// AFK2DUI処理 [ afk2dui.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "object2D.h"

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CAfk2DUI:public CObject2D
{
public:
	CAfk2DUI();
	~CAfk2DUI();

	HRESULT Init();
	void Uninit(void);
	void Update(void);
	void Draw(void);
	
	static CAfk2DUI* Create(void);

	bool GetAfkButton(void) { return m_bAfkButton; }

	void EasingSine(void);


private:

	D3DXVECTOR3 m_pos;		// 位置
	float m_fCountFrame;	// イージング用フレームカウント用変数
	float m_fMaxFrame;		// 最大フレーム変数
	bool m_bAfkButton;		// ボタン識別判定用変数
	bool m_bEasing;			// イージング用変数
	bool m_bDisplay;		// 表示するかの判定変数
};

