//=========================================================
//
// AFKBench処理 [ afkbench.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "afk.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CParticle;

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CAfkBench : public CAfk
{
public:
	CAfkBench();
	~CAfkBench();

	HRESULT Init(D3DXVECTOR3 pos);
	void Uninit(void);
	void Update(void);

	void SetDisplay(bool bDisplay) { m_bDisplay = bDisplay; }

	/// <summary>
	/// 生成処理
	/// </summary>
	/// <param name="pos">生成処理</param>
	/// <returns></returns>
	static CAfkBench* Create
	(
		const D3DXVECTOR3& pos
	);

private:
	CParticle* m_pParticle;		// パーティクル用のポインタ変数
	bool m_bDisplay;			// パーティクル表示の判定用変数
};

