//=========================================================
//
// AFKEating処理 [ afkeating.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "afk.h"

//*********************************************************
// 食事サボりクラスを定義
//*********************************************************
class CAfkEating : public CAfk
{
public:
	CAfkEating();
	~CAfkEating();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	/// <summary>
	/// 生成処理
	/// </summary>
	/// <param name="pos">生成処理</param>
	/// <returns></returns>
	static CAfkEating* Create
	(
		const D3DXVECTOR3& pos
	);
};

