//=========================================================
//
// AFKGameCenter処理 [ afkgamecenter.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "afk.h"

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CAfkGameCenter : public CAfk
{
public:
	CAfkGameCenter();
	~CAfkGameCenter();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	/// <summary>
	/// 生成処理
	/// </summary>
	/// <param name="pos">生成処理</param>
	/// <returns></returns>
	static CAfkGameCenter* Create
	(
		const D3DXVECTOR3& pos
	);

private:
};

