//=========================================================
//
// AFKMagazine処理 [ afkmagazine.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "afk.h"

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CAfkMagazine : public CAfk
{
public:
	CAfkMagazine();
	~CAfkMagazine();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	/// <summary>
	/// 生成処理
	/// </summary>
	/// <param name="pos">生成処理</param>
	/// <returns></returns>
	static CAfkMagazine* Create
	(
		const D3DXVECTOR3& pos
	);

private:
};

