//=========================================================
//
// AFKたばこ処理 [ afksmoke.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "afk.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CSphereCollider;

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CAfksmoke : public CAfk
{
public:

	CAfksmoke();
	~CAfksmoke();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	
	/// <summary>
	/// 生成処理
	/// </summary>
	/// <param name="pos">生成処理</param>
	/// <param name="radius">半径</param>
	/// <returns></returns>
	static CAfksmoke* Create
	(
		const D3DXVECTOR3& pos,
		const float& fRadius
	);

private:
};

