//=========================================================
//
// AfkUIManager処理 [ afkuimanager.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CAfkUIManager
{
public:

	CAfkUIManager();
	~CAfkUIManager();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	// インスタンス生成用関数
	static CAfkUIManager* Instance(void);

private:
	static CAfkUIManager* m_pInstance;	// シングルトン変数

};

