//=========================================================
//
// 警告表示処理 [ alert.h ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 警告表示に対するクラスを定義
//*********************************************************
class CAlert
{
public:

	CAlert();
	~CAlert();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 生成処理
	static CAlert* Create(void);

private:

	// メンバ変数
};