//=========================================================
//
// 監査役のデータ保持場所 [ auditorutilty.h ]
// Author : Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 定数空間宣言
//*********************************************************
namespace AuditorUtility
{
	// オフィス回り巡回
	constexpr int OFFICE_POINT = 4;
	const D3DXVECTOR3 OfficePoint[OFFICE_POINT] =
	{
		{830.0f, 0.0f, -10.0f},
		{825.0f, 0.0f, 635.0f},
		{840.0f, 0.0f, 300.0f},
		{820.0f, 0.0f, -300.0f},
	};

	// ゲーセン巡回
	constexpr int GAME_POINT = 10;
	const D3DXVECTOR3 GameCenterPoint[GAME_POINT] =
	{
		{1400.0f, 0.0f, 222.0f},
		{1400.0f, 0.0f, 108.0f},
		{1586.0f, 0.0f, 109.0f},
		{1760.0f, 0.0f, 101.0f},
		{1760.0f, 0.0f, 395.0f},
		{1525.0f, 0.0f, 390.0f},
		{1530.0f, 0.0f, 103.0f},
		{1150.0f, 0.0f, 115.0f},
		{1143.0f, 0.0f, 333.0f},
		{1400.0f, 0.0f, 333.0f}
	};

	// 蕎麦屋巡回
	constexpr int SOBA_POINT = 8;
	const D3DXVECTOR3 SobaPoint[SOBA_POINT] =
	{
		{2142.0f, 0.0f, -460.0f},
		{2020.0f, 0.0f, -757.0f},
		{1710.0f, 0.0f, -754.0f},
		{1303.0f, 0.0f, -644.0f},
		{1377.0f, 0.0f, -360.0f},
		{1952.0f, 0.0f, -377.0f},
		{1948.0f, 0.0f, 297.0f},
		{2186.0f, 0.0f, 300.0f}

	};

	// マップの左側巡回
	constexpr int LEFTSIDE_POINT = 6;
	const D3DXVECTOR3 LeftSidePoint[LEFTSIDE_POINT] =
	{
		{1705.0f, 0.0f, 1188.0f},
		{932.0f, 0.0f, 1235.0f},
		{922.0f, 0.0f, 938.0f},
		{2042.0f, 0.0f, 942.0f},
		{2178.0f, 0.0f,612.0f},
		{2137.0f, 0.0f, 1140.0f}
	};
};