//=========================================================
//
// 社長がプレイヤーを追いかける状態のクラス[ bossstatechase.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "bossstatebase.h"

//*********************************************************
// 社長がプレイヤーを追従する状態のクラスを定義
//*********************************************************
class CBossStateChase : public CBossStateBase
{
public:

	CBossStateChase();
	~CBossStateChase();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

	int m_nStayCount;	// 停止中のカウント
	bool m_isDoubt;		// 疑い状態かどうか
};