//=========================================================
//
// 社長通常状態クラス [ bossstateneutral.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "bossstatebase.h"

//*********************************************************
// 敵の通常状態クラスを定義
//*********************************************************
class CBossStateNeutral : public CBossStateBase
{
public:

	CBossStateNeutral();
	~CBossStateNeutral();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};