//=========================================================
//
// クライアントキャラクターのデータ保持ファイル [ clientutility.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 基本情報格納名前空間
//*********************************************************
namespace CLIENT_INFO
{
	constexpr const char* MOTIONNAME = "data/MOTION/Client/ClientMotion.txt";
	constexpr int MAX_CHANGETIME = 180;
	constexpr float SPHERESIZE = 50.0f;
};