//===================================================================
//
// AuditorクラスをJsonから生成する処理 [ createjsonauditor.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"

//*******************************************************************
// 外の監査役をJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateAuditor : public CJsonCreator
{
public:

	CJsonCreateAuditor() = default;
	~CJsonCreateAuditor() = default;

	/// <summary>
	/// 監査役を生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};