//===================================================================
//
// 動くキャラクターをJsonから生成する処理 [ createjsonmove.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include <json.hpp>

//*******************************************************************
// 名前空間を定義
//*******************************************************************
namespace JsonMove
{
	using json = nlohmann::json;
};

//*******************************************************************
// 動くキャラクターをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreateMove
{
public:

	CJsonCreateMove() = default;
	~CJsonCreateMove() = default;

	/// <summary>
	/// 生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	static void Create(const JsonMove::json& Jsondata);

private:
};