//===================================================================
//
// 3dポリゴンをJsonから生成する処理 [ createjsonpolygon.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "jsoncreator.h"
#include <json.hpp>

//*******************************************************************
// 3dポリゴンをJsonから生成するクラスを定義
//*******************************************************************
class CJsonCreatePolygon : public CJsonCreator
{
public:

	CJsonCreatePolygon() = default;
	~CJsonCreatePolygon() = default;

	/// <summary>
	/// 生成するクラス
	/// </summary>
	/// <param name="Jsondata">渡されるデータ</param>
	void Create(const json& Jsondata) override;

private:
};