//=========================================================
//
// タスク処理 [ deskwork.h ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// タスクに対するクラスを定義
//*********************************************************
class CDeskwork
{
public:

	CDeskwork();
	~CDeskwork();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 生成処理
	static CDeskwork* Create(const D3DXVECTOR3& pos);

private:

	// メンバ変数
	D3DXVECTOR3 m_pos; // タスクのテクスチャ座標
};