//=========================================================
//
// 敵を使うのに必要な宣言をまとめたファイル [ enemyutility.h ]
// Author : Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 煙草回りの動きの名前空間
//*********************************************************
namespace SMOKE_AND_MAGAZINE
{
	// 最大ポイント数
	constexpr int ALL_POINT = 10;

	// 巡回ポイント配列
	const D3DXVECTOR3 ViewPoint[ALL_POINT] =
	{
		{416.0f,0.0f,186.0f},
		{261.0f,0.0f,182.0f},
		{266.0f,0.0f,277.0f},
		{381.0f,0.0f,275.0f},
		{266.0f,0.0f,277.0f},
		{261.0f,0.0f,182.0f},
		{148.0f,0.0f,176.0f},
		{139.0f,0.0f,32.0f},
		{409.0f,0.0f,27.0f},
		{416.0f,0.0f,186.0f}
	};
};

//*********************************************************
// テレビと食事回りの動きの名前空間
//*********************************************************
namespace TV_AND_EATING
{
	// 最大ポイント数
	constexpr int ALL_POINT = 8;

	// 巡回ポイント配列
	const D3DXVECTOR3 ViewPoint[ALL_POINT] =
	{
		{-114.0f,0.0f,231.0f},
		{-194.0f,0.0f,235.0f},
		{-114.0f,0.0f,231.0f},
		{-120.0f,0.0f,90.0f},
		{-220.0f,0.0f,87.0f},
		{-213.0f,0.0f,-83.0f},
		{-103.0f,0.0f,-82.0f},
		{-114.0f,0.0f,231.0f}
	};
};
//*********************************************************
// 追ってくるウェイポイント配列 ( たくさん置く )
//*********************************************************
namespace NavInfo
{
	// マップ上のに配置したウェイポイント配列
	const D3DXVECTOR3 WayPoints[] = 
	{
		D3DXVECTOR3(-126.0f, 0.0f,237.0f),
		D3DXVECTOR3(-124.0f, 0.0f,167.0f),
		D3DXVECTOR3(-210.0f, 0.0f,225.0f),
		D3DXVECTOR3(-225.0f, 0.0f,225.0f),
		D3DXVECTOR3(-192.0f, 0.0f,311.0f),
		D3DXVECTOR3(-297.0f, 0.0f,323.0f),
		D3DXVECTOR3(-122.0f, 0.0f,82.0f),
		D3DXVECTOR3(-227.0f, 0.0f,80.0f),
		D3DXVECTOR3(-225.0f, 0.0f,4.5f),
		D3DXVECTOR3(-222.0f, 0.0f,-105.0f),
		D3DXVECTOR3(-222.0f, 0.0f,-170.0f),
		D3DXVECTOR3(-85.0f, 0.0f,-155.0f),
		D3DXVECTOR3(-213.0f, 0.0f,-110.0f),
		D3DXVECTOR3(-90.0f, 0.0f,-45.0f),
		D3DXVECTOR3(-15.0f, 0.0f,40.0f),
		D3DXVECTOR3(74.0f, 0.0f,40.0f),
		D3DXVECTOR3(74.0f, 0.0f,-50.0f),
		D3DXVECTOR3(77.0f, 0.0f,-135.0f),
		D3DXVECTOR3(-7.0f, 0.0f,-152.0f),
		D3DXVECTOR3(74.0f, 0.0f,130.0f),
		D3DXVECTOR3(72.0f, 0.0f,235.0f),
		D3DXVECTOR3(-2.5f, 0.0f,230.0f),
		D3DXVECTOR3(-88.0f, 0.0f,345.0f),
		D3DXVECTOR3(142.0f, 0.0f,277.0f),
		D3DXVECTOR3(152.0f, 0.0f,132.0f),
		D3DXVECTOR3(134.0f, 0.0f,51.0f),
		D3DXVECTOR3(265.0f, 0.0f,170.0f),
		D3DXVECTOR3(260.0f, 0.0f,260.0f),
		D3DXVECTOR3(273.0f, 0.0f,351.0f),
		D3DXVECTOR3(345.0f, 0.0f,174.0f),
		D3DXVECTOR3(421.0f, 0.0f,100.0f),
		D3DXVECTOR3(421.0f, 0.0f,153.0f),
		D3DXVECTOR3(405.0f, 0.0f,44.0f),
		D3DXVECTOR3(330.0f, 0.0f,30.0f),
		D3DXVECTOR3(255.0f, 0.0f,30.0f),
		D3DXVECTOR3(185.0f, 0.0f,25.0f),
		D3DXVECTOR3(168.0f, 0.0f,-75.0f),
		D3DXVECTOR3(109.0f, 0.0f,110.0f),
		D3DXVECTOR3(90.0f, 0.0f,-65.0f),
		D3DXVECTOR3(-140.0f, 0.0f,-90.0f),
		D3DXVECTOR3(-18.0f, 0.0f,-153.0f),
		D3DXVECTOR3(-80.0f, 0.0f,25.0f),
		D3DXVECTOR3(88.0f, 0.0f,315.0f),
	};

	// 最大個数を設定
	const int POINT_MAX = sizeof(WayPoints) / sizeof(WayPoints[0]);
}