//=========================================================
//
// 敵がプレイヤーを探す状態のクラス[ enemystateserch.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemystatebase.h"

//*********************************************************
// 探索状態クラスを定義
//*********************************************************
class CEnemyStateSerch : public CEnemyStateBase
{
public:

	CEnemyStateSerch();
	~CEnemyStateSerch();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};