//=========================================================
//
// プレイヤーを疑っている状態のクラス [ enemystatedoubt.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "enemystatedoubt.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemy.h"
#include "manager.h"
#include "enemystateneutral.h"

//=========================================================
// コンストラクタ
//=========================================================
CEnemyStateDoubt::CEnemyStateDoubt() : CEnemyStateBase(),
m_nDoubtCount(0)
{
	// IDセット
	SetID(ID_DOUBT);
}
//=========================================================
// デストラクタ
//=========================================================
CEnemyStateDoubt::~CEnemyStateDoubt()
{

}
//=========================================================
// 開始関数
//=========================================================
void CEnemyStateDoubt::OnStart(void)
{
	// モーションセット
	//m_pEnemy->GetMotion()->SetMotion(CEnemy::MOTION::);
}
//=========================================================
// 更新関数
//=========================================================
void CEnemyStateDoubt::OnUpdate(void)
{
	// もし視界内に入っていたら
	if (m_pEnemy->CheckEyesight())
	{
		// カウントを加算
		m_nDoubtCount++;

		// ui表示(はてなマーク)

		// モーションセット ( 疑い )
		//m_pEnemy->GetMotion()->SetMotion()
	}

	// もし上限値を超えていたら
	if (m_nDoubtCount >= Config::MAX_DOUBT_COUNT)
	{
		// 猛追ステートに変更する

		return;
	}
}
//=========================================================
// 終了関数
//=========================================================
void CEnemyStateDoubt::OnExit(void)
{
	// リセット
	m_nDoubtCount = 0;
}