//=========================================================
//
// プレイヤーを追いかける状態のクラス[ enemystatechase.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemystatebase.h"

//*********************************************************
// 追従状態のクラスを定義
//*********************************************************
class CEnemyStateChase : public CEnemyStateBase
{
public:

	CEnemyStateChase();
	~CEnemyStateChase();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

	int m_nStayCount;	// 停止中のカウント
	bool m_isDoubt;	// 疑い状態かどうか
};