//=========================================================
//
// 敵の通常状態クラス [ enemystateneutral.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemystatebase.h"

//*********************************************************
// 敵の通常状態クラスを定義
//*********************************************************
class CEnemyStateNeutral : public CEnemyStateBase
{
public:
	CEnemyStateNeutral();
	~CEnemyStateNeutral();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};