//=========================================================
//
// 敵を使うのに必要な宣言をまとめたファイル [ enemyutility.h ]
// Author : Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 煙草回りの動きの名前空間
//*********************************************************
namespace SMOKE_AND_MAGAZINE
{
	// 最大ポイント数
	constexpr int ALL_POINT = 10;

	// 巡回ポイント配列
	const D3DXVECTOR3 ViewPoint[ALL_POINT] =
	{
		{416.0f,0.0f,186.0f},
		{261.0f,0.0f,182.0f},
		{266.0f,0.0f,277.0f},
		{381.0f,0.0f,275.0f},
		{266.0f,0.0f,277.0f},
		{261.0f,0.0f,182.0f},
		{148.0f,0.0f,176.0f},
		{139.0f,0.0f,32.0f},
		{409.0f,0.0f,27.0f},
		{416.0f,0.0f,186.0f}
	};
};

//*********************************************************
// テレビと食事回りの動きの名前空間
//*********************************************************
namespace TV_AND_EATING
{
	// 最大ポイント数
	constexpr int ALL_POINT = 8;

	// 巡回ポイント配列
	const D3DXVECTOR3 ViewPoint[ALL_POINT] =
	{
		{-114.0f,0.0f,231.0f},
		{-194.0f,0.0f,235.0f},
		{-114.0f,0.0f,231.0f},
		{-120.0f,0.0f,90.0f},
		{-220.0f,0.0f,87.0f},
		{-213.0f,0.0f,-83.0f},
		{-103.0f,0.0f,-82.0f},
		{-114.0f,0.0f,231.0f}
	};
};
//*********************************************************
// 追ってくるウェイポイント配列
//*********************************************************
namespace NavInfo
{
	// マップ上の角や抜け道に配置したウェイポイント配列
	const D3DXVECTOR3 WayPoints[] = 
	{
		D3DXVECTOR3(-130.0f, 0.0f,222.0f),
		D3DXVECTOR3(-285.0f, 0.0f,222.0f),
		D3DXVECTOR3(-98.0f, 0.0f,-2.0f),
		D3DXVECTOR3(-233.0f, 0.0f,32.0f),
		D3DXVECTOR3(-218.0f, 0.0f,-155.0f),
		D3DXVECTOR3(78.0f, 0.0f,128.0f),
		D3DXVECTOR3(95.0f, 0.0f,22.0f),
		D3DXVECTOR3(118.0f, 0.0f,218.0f),
		D3DXVECTOR3(258.0f, 0.0f,177.0f),
		D3DXVECTOR3(405.0f, 0.0f,88.0f),
		D3DXVECTOR3(274.0f, 0.0f,25.0f),
		D3DXVECTOR3(258.0f, 0.0f,356.0f),
	};

	// 最大個数を設定
	const int POINT_MAX = sizeof(WayPoints) / sizeof(WayPoints[0]);
}