//=========================================================
//
// イベントUI処理 [ eventUI.h ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// イベントUIに対するクラスを定義
//*********************************************************
class CEventUI
{
public:

	CEventUI();
	~CEventUI();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 生成処理
	static CEventUI* Create(void);

private:

};