//=========================================================
//
// イベントUI処理 [ eventUI.h ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "object2D.h"

//*********************************************************
// イベントUIに対するクラスを定義
//*********************************************************
class CEventUI :public CObject2D
{
public:

	CEventUI(int nPriority = static_cast<int>(CObject::PRIORITY::UI));
	~CEventUI();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 生成処理
	static CEventUI* Create(void);

private:

	// メンバ変数
};