//=========================================================
//
// イベント処理 [ event.h ]
// Author: 
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// ブロックオブジェクトクラスを定義
//*********************************************************
class CEvent
{
public:

	CEvent();
	~CEvent();

	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 静的メンバ関数

private:

	// メンバ変数
	int m_kari;

	// 静的メンバ変数
	static int m_kariS;

};
