//=========================================================
//
// カットイン処理 [ eventcutin.h ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// カットインに対するクラスを定義
//*********************************************************
class CEventcutin
{
public:

	CEventcutin();
	~CEventcutin();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 生成処理
	static CEventcutin* Create(void);

private:

	// メンバ変数
};