//=========================================================
//
// ゲームのタイマー処理 [ gametime.h ]
// Author: Takahashi Misaki
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "object.h"

//*********************************************************
// ゲームのタイマーに対するクラスを定義
//*********************************************************
class CGametime :public CObject
{
public:

	CGametime(int nPriority = static_cast<int>(CObject::PRIORITY::UI));
	~CGametime();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	// 生成処理
	static CGametime* Create(void);

private:

	// メンバ変数
};