//=========================================================
//
// 捕まった時のリザルトシーン処理 [ loselazyresult.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CBlockManager;

//*********************************************************
// 捕まった時のリザルトシーンクラスを定義
//*********************************************************
class CLoseLazyResult : public CScene
{
public:

	CLoseLazyResult();
	~CLoseLazyResult();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
	std::unique_ptr<CBlockManager> m_pBlock;	// ブロック管理クラス
};