//=========================================================
//
// プレイヤーステートスモーククラス処理 [ playerstatesmoke.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// プレイヤーステートアクションクラスを定義
//*********************************************************
class CPlayerStateSmoke : public CPlayerStateBase
{
public:
	CPlayerStateSmoke();
	~CPlayerStateSmoke();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

};