//=========================================================
//
// 飲食さぼり状態クラス処理 [ playerstateeating.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// ゲームセンターサボり状態クラスを定義
//*********************************************************
class CPlayerStateEating : public CPlayerStateBase
{
public:
	CPlayerStateEating();
	~CPlayerStateEating();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:
};