//=========================================================
//
// プレイヤーステートアクションクラス処理 [ playerstateaction.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// プレイヤーステートニュートラルクラスを定義
//*********************************************************
class CPlayerStateAction : public CPlayerStateBase
{
public:
	CPlayerStateAction();
	~CPlayerStateAction();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;


private:

};