//=========================================================
//
// TV見ているサボりの状態クラス処理 [ playerstatetv.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// TV見ているサボり状態クラスを定義
//*********************************************************
class CPlayerStateTV : public CPlayerStateBase
{
public:

	CPlayerStateTV();
	~CPlayerStateTV();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};