//=========================================================
//
// ベンチさぼり状態クラス処理 [ playerstatebench.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// ゲームセンターサボり状態クラスを定義
//*********************************************************
class CPlayerStateBench : public CPlayerStateBase
{
public:
	CPlayerStateBench();
	~CPlayerStateBench();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:
};