//=========================================================
//
// 雑誌読みサボり状態クラス処理 [ playerstatemagazine.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// 雑誌読みサボり状態クラスを定義
//*********************************************************
class CPlayerStateMagazine : public CPlayerStateBase
{
public:
	CPlayerStateMagazine();
	~CPlayerStateMagazine();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};