//=========================================================
//
// プレイヤーステートディッチクラス処理 [ playerstateditch.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// プレイヤーステートアクションクラスを定義
//*********************************************************
class CPlayerStateDitch : public CPlayerStateBase
{
public:
	CPlayerStateDitch();
	~CPlayerStateDitch();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};