//=========================================================
//
// プレイヤーステートアクションクラス処理 [ playerstateaction.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// プレイヤーステートアクションクラスを定義
//*********************************************************
class CPlayerStateMagazine : public CPlayerStateBase
{
public:
	CPlayerStateMagazine();
	~CPlayerStateMagazine();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};