//=========================================================
//
// プレイヤーステートニュートラルクラス処理 [ playerstateneutral.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// プレイヤーステートニュートラルクラスを定義
//*********************************************************
class CPlayerStateNeutral : public CPlayerStateBase
{
public:
	CPlayerStateNeutral();
	~CPlayerStateNeutral();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

	
private:

};