//=========================================================
//
// プレイヤーステートムーブクラス処理 [ playerstatemove.h ]
// Author: Shouya Chikada
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// プレイヤーステートニュートラルクラスを定義
//*********************************************************
class CPlayerStateMove : public CPlayerStateBase
{
public:
	CPlayerStateMove();
	~CPlayerStateMove();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;


private:

};