//=========================================================
//
// ランキングの横棒グラフ複数管理処理 [ rankingglaphmanager.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <array>
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************
class CLoad;

//*********************************************************
// ランキングの横棒グラフ管理処理クラス定義
//*********************************************************
class CRankingGraphManager
{
public:

	~CRankingGraphManager();

	HRESULT Init(const D3DXVECTOR3& pos,float fWidth,float fHeight);
	void Uninit(void);
	void Update(void);

private:

	CRankingGraphManager();

private:

	//*************************************
	// 定数構造体宣言
	//*************************************
	struct Config
	{
		static constexpr int DATA_MAX = 5;			// 表示する横棒の数
		static constexpr float POS_Y_VALUE = 65.0f;	// ずらすY座標値
	};
};