//=========================================================
//
// ランキングのオブジェクト管理 [ rankingobject.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************
class CBlockManager;

//*********************************************************
// ランキングで使うオブジェクトを管理するクラスを定義
//*********************************************************
class CRankingObject
{
public:

	~CRankingObject();

	HRESULT Init(void);
	void Uninit(void);

	static CRankingObject* GetInstance(void);

private:

	CRankingObject(); // 格納コンストラクタ

	static CRankingObject* m_pInstance; // シングルトン変数

private:
	std::unique_ptr<CBlockManager> m_pBlock;	// ブロック管理クラス
};

