////=========================================================
////
//// タスクコマンド処理 [ taskcommand.h ]
//// Author: Takahashi Misaki
////
////=========================================================
//
////*********************************************************
//// インクルードガード
////*********************************************************
//#pragma once
//
////*********************************************************
//// インクルード
////*********************************************************
//#include "command.h"
//#include "deskworkUI.h"
//
////*********************************************************
//// Wコマンドクラスを定義
////*********************************************************
//class CWCommand :public CCommand
//{
//public:
//
//	CWCommand();
//	~CWCommand();
//
//	// 更新処理
//	bool Update(const CDeskworkUI* m_pDeskworkUI, int& nIdx);
//
//private:
//
//};
//
////*********************************************************
//// Aコマンドクラスを定義
////*********************************************************
//class CACommand :public CCommand
//{
//public:
//
//	CACommand();
//	~CACommand();
//
//	// 更新処理
//	void Update(void);
//
//private:
//
//};
//
////*********************************************************
//// Sコマンドクラスを定義
////*********************************************************
//class CSCommand :public CCommand
//{
//public:
//
//	CSCommand();
//	~CSCommand();
//
//	// 更新処理
//	void Update(void);
//
//private:
//
//};
//
////*********************************************************
//// Dコマンドクラスを定義
////*********************************************************
//class CDCommand :public CCommand
//{
//public:
//
//	CDCommand();
//	~CDCommand();
//
//	// 更新処理
//	void Update(void);
//
//private:
//
//};