//==========================================================
//
// テストシーン処理 [ testscene.h ]
// Author: Asuma Nishio
//
//==========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// インクルードファイル
//*********************************************************
#include "scene.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CBoss;
class CBlockManager;

//*********************************************************
// 検証用シーンクラスを定義
//*********************************************************
class CTest : public CScene
{
public:

	CTest();
	~CTest();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:
	CBoss* m_pBoss;	// テストオブジェクト(ボスで検証したい)
	std::unique_ptr<CBlockManager>m_pBlocks;		// ブロックマネージャークラスのポインタ
};