//=========================================================
//
// タイトルで出現するオブジェクト管理処理 [ titleobject.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// システムインクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************
class CBlockManager;

//*********************************************************
// タイトルオブジェクト管理クラスを定義
//*********************************************************
class CTitleObject
{
public:

	~CTitleObject();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	
	static CTitleObject* GetInstance(void);
	
private:

	CTitleObject();					  // コンストラクタ

private:

	static CTitleObject* m_pInstance; // シングルトン変数

private:
	std::unique_ptr<CBlockManager> m_pBlock; // ブロック管理クラス
};